「小岛时间」自动续费服务协议

当前版本更新时间：2024年05月1日
当前版本生效时间：2024年05月1日

【注意事项】
欢迎您使用和接受「小岛时间」（以下简称“本应用”）提供的会员自动续费服务（以下简称“自动续费服务”）。

在开通自动续费服务之前，请您务必审慎阅读《自动续费服务协议》（以下简称“本协议”）并充分理解各条款内容， 特别是以字体加粗的方式提示您重点阅读的免除或限制责任的相关条款。

本协议为《会员服务协议》的补充协议，是其不可分割的一部分。本协议与上述内容存在冲突的，以本协议为准。

如果您未满18周岁，请在法定监护人的陪同下阅读本协议，并特别注意未成年人使用条款。

正文
第一条 定义和适用范围
1. 《自动续费服务协议》：指您与本应用之间关于您使用自动续费服务所订立的协议包括：本协议正文、会员服务页面说明、服务条款及本协议的更新版。本协议全部组成文件一经发布/公示，即成为本协议不可分割的组成部分。

2. 自动续费：指出于您的自动续费需求，在苹果订阅期即将过期前24小时，从您的iTunes账户中扣除下一个订阅期服务费用的续费方式。

3. 本协议适用于您和本应用，您和本应用应当严格遵守本协议约定的内容。

（1） 如您不同意本协议中的任一条款，应立即停止开通自动续费服务；

（2） 如您已完成了包括但不限于点击“解锁高级功能”按钮等在内的任一能够表明同意本协议全部或部分条款的操作，即表示您同意接受本协议、《会员服务协议》、相关子协议、页面说明、服务条款及规则等全部内容的约束；

（3） 如本协议条款发生变更或修改，本应用将在相关页面上进行公告。如您不同意本协议的任一变更或修改，可以取消已开通的自动续费服务；如您继续使用自动续费服务，则视为您已经接受本协议的全部变更或修改。

第二条 自动续费服务的开通和使用说明
（1） 在您依据《会员服务协议》开通会员服务的同时，可点击“解锁高级功能”等按钮开通自动续费服务。

（2） 在您成功开通自动续费服务后，会在苹果订阅期到期前24小时，从您的iTunes账户中扣费下一个订阅期服务费并延长该订阅期对应的会员有效期限。如因iTunes账户余额不足导致扣款失败，本应用有权暂停/终止您的会员服务。

（3） 您开通自动续费服务后，即视为您同意在苹果订阅期到期前24小时，从您的iTunes账户扣除下一个订阅期的服务费用。

第三条 自动续费服务的取消
（1） 取消方式：打开苹果手机“设置” --> 进入“iTunes Store 与 App Store”-->点击 “Apple ID”，选择"查看Apple ID"，进入"账户设置"页面，点击“订阅”，选择取消订阅即可。

（2） 自动续费服务取消成功后，不影响您当期已生效的会员服务，当期会员服务届满后将不再续费。

（3） 您理解并同意，如您未在苹果订阅期到期24小时前取消自动续费功能，将会自动从您的iTunes账户扣款。一旦扣款成功，已扣款项不予退还。

第四条 其他
（1） 如您对本协议或自动续费服务相关事宜有任何问题，可通过发送邮件至784553184@qq.com与本应用取得联系，本应用在收到您的意见/建议后，会尽快回复您。
